<template>
<div style="position: relative;">
  <div class="bbox-ad">
    <div class="title-ad el-icon-data-line">数据可视化图表</div>
    <div class="box1-ad">
      <div class="b-ad" id="b1-ad"></div>
      <div class="b-ad" id="b2-ad"></div>
    </div>

    <div class="box2-ad">
      <div
        style="
          font-size: 25px;
          color: #4c4c4c;
          padding-left: 1%;
          padding-bottom: 1%;
        "
        class="el-icon-time"
      >
        最近更新
      </div>
      <div class="InfiniteScroll">
        <div
          class="scroll_parent_box"
          @mouseenter="mEnter"
          @mouseleave="mLeave"
        >
          <div
            class="scroll_list"
            :style="{ transform: `translate(0px,-${scrollTop}px)` }"
          >
            <div ref="scrollItemBox">
              <div
                class="list-li-ad"
                v-for="(list, index) in list"
                :key="index"
              >
                <div class="ul-ad">
                  <router-link to="/bookdetail"
                    ><img
                      class="r-img-ad"
                      v-lazy="list.imgFix"
                      :key="list.imgFix"
                      @click="goBook(list)"
                  /></router-link>
                  <router-link to="/bookdetail" class="r-name-ad"
                    ><div class="r-name-overflow-ad" @click="goBook(list)">
                      {{ list.name }}
                    </div></router-link
                  >
                  <div class="r-author-ad">{{ list.author }}</div>
                </div>
              </div>
            </div>
            <div v-html="copyHtml"></div>
          </div>
        </div>
      </div>
    </div>

    <div class="box3-ad">
      <div class="b-ad" id="b3-ad">
        <div class="bid3-ad el-icon-folder">
          书籍总储量:<span> 2672326</span>
        </div>
        <div class="bid3-ad el-icon-reading">
          在线阅读书籍储量:<span> 3596</span>
        </div>
        <div class="bid3-ad el-icon-office-building">
          收录最多的出版社:<span> 科学出版社</span>
        </div>
        <div class="bid3-ad el-icon-user-solid">
          收录最多的作者:<span> 李永新</span>
        </div>
      </div>
      <div class="b-ad" id="b4-ad"></div>
    </div>

    <div class="box4-ad">
      <div class="b-ad" id="b5-ad"></div>
      <div class="b-ad" id="b6-ad"></div>
    </div>
  </div>
</div>
</template>

<script>
import request from "../api/request";
import cheerio from "cheerio";
import * as echarts from "echarts";
import "echarts-wordcloud";
import { useStore } from "@/store/index";
let timer = null;
export default {
  name: "echart",
  components: {},
  data() {
    return {
      list: [],
      scrollTop: 0, //列表滚动高度
      speed: 35, //滚动的速度
      copyHtml: "", //复制多一份防止滚动到后面出现空白
    };
  },
  methods: {
    async ec1() {
      let myChart = echarts.init(document.getElementById("b1-ad"));
      // let count = await request.get('/base/echart/3');
      // let values = [];
      // let names = [];
      //  for (let key of count.data) {
      //   values.push(key.value)
      //   names.push(key.name)
      //  }
      let option = {
        title: {
          text: "图书种类分布",
          left: "left",
          color: "#4c4c4c",
        },
        tooltip: {
          trigger: "item",
          formatter: "{a} <br/>{b}: {c} ({d}%)",
        },
        legend: {
          // x: "right",
          top:25,
          itemWidth: 12,
          itemHeight: 12,
          align: "left",
          data: [
            "经济管理",
            "科学技术",
            "生活时尚",
            "暂缺分类",
            "文学艺术",
            "教育/教材/教辅",
            "工具书",
            "少儿",
            "古籍/国学",
            "人文社科",
          ],
          textStyle: {
            color: "#4c4c4c",
          },
        },
        series: [
          {
            name: "书籍占比",
            type: "pie",
            radius: ["10%", "40%"],
            center: ["42%", "60%"],
            color: [
              "#d74e67",
              "#0092ff",
              "#eba954",
              "#21b6b9",
              "#60a900",
              "#01949b",
              "#f17677",
              "#8B4513",
              "#4B0082",
              "#2E8B57",
            ],
            label: {
              normal: {
                formatter: "{b}\n{d}%",
              },
            },
            data: [
              {
                value: 284052,
                name: "经济管理",
              },
              {
                value: 648781,
                name: "科学技术",
              },
              {
                value: 152145,
                name: "生活时尚",
              },
              {
                value: 97382,
                name: "暂缺分类",
              },
              {
                value: 511303,
                name: "文学艺术",
              },
              {
                value: 401370,
                name: "教育/教材/教辅",
              },
              {
                value: 15147,
                name: "工具书",
              },
              {
                value: 118219,
                name: "少儿",
              },
              {
                value: 22063,
                name: "古籍/国学",
              },
              {
                value: 420705,
                name: "人文社科",
              },
            ],
          },
        ],
      };

      myChart.setOption(option);
    },
    async ec2() {
      // let row =await request.get('/base/echart/1')
      // let rows = []
      // let column =await request.get('/base/echart/2')
      // let columns = []
      // for (let key of row.data) {
      //   rows.push(key.row)
      // }
      // for (let key of column.data) {
      //   columns.push(((key.coulmn)+',').match(/,/g).length)
      // }
      // console.log(column);
      // console.log(row);
      // console.log(columns);
      // console.log(rows);
      //如果要从数据库获取,line数据为columns,row数据为rows
      //数字经过slice筛选,因为前面日子书太少
      let myChart = echarts.init(document.getElementById("b2-ad"));
      let data1 = [
        1855, 1876, 1878, 1879, 1880, 1882, 1884, 1888, 1898, 1899, 1900, 1901,
        1905, 1911, 1912, 1913, 1915, 1916, 1919, 1920, 1921, 1922, 1923, 1925,
        1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937,
        1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949,
        1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961,
        1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973,
        1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985,
        1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997,
        1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
        2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021,
        2022, 2023,
      ];
      let data2 = [
        1, 1, 1, 1, 1, 1, 1, 5, 1, 5, 27955, 212, 6, 9, 1, 1, 1, 1, 1, 1, 1, 3,
        3, 3, 1, 3, 3, 9, 6, 3, 4, 12, 6, 8, 13, 20, 8, 7, 2, 4, 5, 3, 4, 6, 9,
        14, 23, 319, 1503, 2043, 1364, 1760, 2177, 2815, 3916, 3628, 5024, 3553,
        2272, 1264, 1447, 1886, 1802, 1999, 865, 290, 257, 342, 1562, 1049,
        1954, 2668, 3177, 3707, 3270, 3988, 5661, 8152, 9684, 10963, 11323,
        11098, 11938, 13623, 15786, 18990, 20958, 17423, 15739, 16295, 19494,
        22193, 20881, 21377, 22281, 25059, 25339, 28832, 34726, 39532, 41169,
        28168, 6836, 5204, 6635, 14281, 97776, 134587, 151199, 162285, 177363,
        180553, 173050, 174348, 160323, 138606, 124074, 113308, 104587, 81284,
        54779, 3115,
      ];
      let start = 42;
      let end = 48; //122
      let option = {
        title: {
          text: "按出版时间分类书籍数量(1945~2023)",
          left: "center",
          textStyle: { fontSize: 16 },
        },
        tooltip: {
          trigger: "axis",
          axisPointer: { type: "shadow" },
        },
        grid: {
          left: "4%",
          right: "4%",
          bottom: "8%",
          containLabel: true,
        },
        xAxis: [
          {
            type: "category",
            axisTick: { show: false },
            axisLabel: {
              textStyle: { fontSize: 14, color: "#4D4D4D" },
            },
            axisLine: {
              lineStyle: { color: "#707070" },
            },
            data: data1.slice(42, 48),
          },
        ],
        yAxis: {
          type: "value",
          name: "年度书籍储量",
          nameTextStyle: { fontSize: 14, color: "#4D4D4D" },
          axisLabel: {
            textStyle: { fontSize: 12, color: "#4D4D4D" },
          },
          axisLine: {
            lineStyle: { color: "#707070" },
          },
        },
        series: [
          {
            name: "该年书籍储量",
            type: "bar",
            barWidth: "60%",
            data: data2.slice(42, 48),
            itemStyle: {
              color: `#428439`,
            },
          },
        ],
      };
      myChart.setOption(option);

      setInterval(() => {
        if (end < 122) {
          start = start + 6;
          end = end + 6;
        } else {
          start = 42;
          end = 48;
        }
        myChart.setOption({
          xAxis: [
            {
              data: data1.slice(start, end),
            },
          ],
          series: [
            {
              data: data2.slice(start, end),
              itemStyle: {
                color: `#${end - 29}8439`,
              },
            },
          ],
        });
      }, 3000);
    },
    async ec3() {
      let myChart = echarts.init(document.getElementById("b6-ad"));
      // let count = await request.get('/base/echart/4');
      // console.log(count.data);
      //data1里面count.data即可
      let data1 = [
        {
          value: 18671,
          name: "青春",
        },
        {
          value: 44,
          name: "计算机应用基础",
        },
        {
          value: 198,
          name: "计算机工具书",
        },
        {
          value: 137603,
          name: "计算机/网络",
        },
        {
          value: 138,
          name: "艺术工具书",
        },
        {
          value: 154089,
          name: "艺术",
        },
        {
          value: 13722,
          name: "航空、航天",
        },
        {
          value: 81695,
          name: "自然科学",
        },
        {
          value: 50438,
          name: "自我实现/励志",
        },
        {
          value: 35144,
          name: "育儿/成长",
        },
        {
          value: 54154,
          name: "考试",
        },
        {
          value: 15275,
          name: "美食",
        },
        {
          value: 2710,
          name: "综合读物",
        },
        {
          value: 1115,
          name: "经部",
        },
        {
          value: 603,
          name: "经管工具书",
        },
        {
          value: 129020,
          name: "经济",
        },
        {
          value: 2777,
          name: "索引/目录",
        },
        {
          value: 104275,
          name: "管理",
        },
        {
          value: 508,
          name: "童话世界",
        },
        {
          value: 13176,
          name: "科普读物",
        },
        {
          value: 12323,
          name: "科普文化",
        },
        {
          value: 1268,
          name: "科技工具书",
        },
        {
          value: 208,
          name: "社科工具书",
        },
        {
          value: 82096,
          name: "社会科学",
        },
        {
          value: 15604,
          name: "环境科学、安全科学",
        },
        {
          value: 10056,
          name: "游戏乐园",
        },
        {
          value: 77899,
          name: "法律",
        },
        {
          value: 852,
          name: "汉语工具书",
        },
        {
          value: 951,
          name: "标准规范",
        },
        {
          value: 22600,
          name: "旅游",
        },
        {
          value: 44730,
          name: "文学天地",
        },
        {
          value: 175248,
          name: "文学",
        },
        {
          value: 29091,
          name: "文化",
        },
        {
          value: 127075,
          name: "教辅",
        },
        {
          value: 32033,
          name: "教育",
        },
        {
          value: 79934,
          name: "教材",
        },
        {
          value: 60949,
          name: "政治",
        },
        {
          value: 5136,
          name: "才艺课堂",
        },
        {
          value: 807,
          name: "年鉴年刊",
        },
        {
          value: 214328,
          name: "工业技术",
        },
        {
          value: 98181,
          name: "小说",
        },
        {
          value: 12561,
          name: "家居",
        },
        {
          value: 13357,
          name: "宗教",
        },
        {
          value: 1317,
          name: "子部",
        },
        {
          value: 4138,
          name: "婚恋/性",
        },
        {
          value: 15206,
          name: "娱乐时尚",
        },
        {
          value: 962,
          name: "外语工具书",
        },
        {
          value: 107888,
          name: "外语",
        },
        {
          value: 2,
          name: "地震",
        },
        {
          value: 2,
          name: "地理学思想史",
        },
        {
          value: 8067,
          name: "地理",
        },
        {
          value: 2,
          name: "地球",
        },
        {
          value: 3,
          name: "地心游记",
        },
        {
          value: 2,
          name: "土木工程材料",
        },
        {
          value: 243,
          name: "历史地理工具书",
        },
        {
          value: 80467,
          name: "历史",
        },
        {
          value: 239,
          name: "医学工具书",
        },
        {
          value: 95045,
          name: "医学",
        },
        {
          value: 6132,
          name: "励志与成长",
        },
        {
          value: 13636,
          name: "动漫世界",
        },
        {
          value: 20589,
          name: "动漫",
        },
        {
          value: 48782,
          name: "农业科学",
        },
        {
          value: 15298,
          name: "军事",
        },
        {
          value: 3955,
          name: "其他工具书",
        },
        {
          value: 14,
          name: "体育与健康",
        },
        {
          value: 19661,
          name: "体育",
        },
        {
          value: 289,
          name: "低幼读物",
        },
        {
          value: 44035,
          name: "传记",
        },
        {
          value: 3078,
          name: "传统文化",
        },
        {
          value: 5,
          name: "会计学",
        },
        {
          value: 9,
          name: "会计基础",
        },
        {
          value: 2,
          name: "优秀蒙古文文学作品翻译出版工程",
        },
        {
          value: 2,
          name: "优秀教师的批评艺术",
        },
        {
          value: 2,
          name: "休闲体育概论",
        },
        {
          value: 15,
          name: "伊索寓言",
        },
        {
          value: 28644,
          name: "交通运输",
        },
      ];
      let option = {
        title: {
          text: "书籍标签词云",
          textStyle: {
            color: "#4c4c4c",
            fontSize: "16",
          },
        },
        grid: {
          left: "1%",
          right: "1%",
          bottom: "1%",
          containLabel: true,
        },
        series: [
          {
            type: "wordCloud",
            //字体的最大与最小字号
            sizeRange: [16, 35],
            //字体旋转的范围
            rotationRange: [0, 90, 135, -90],
            //词云形状 circle:圆形,pentagon:五边形
            //cardioid:苹果形或心形,star:星形,diamond:钻石,
            //triangle-forward:三角形,triangle:三角形,smooth:平滑
            shape: "pentagon",
            textStyle: {
              //字体随机颜色
              color: function () {
                return (
                  "rgb(" +
                  [
                    Math.round(Math.random() * 205),
                    Math.round(Math.random() * 155),
                    Math.round(Math.random() * 205),
                  ].join(",") +
                  ")"
                );
              },
              emphasis: {
                //阴影距离
                shadowBlur: 1,
                //阴影颜色
                shadowColor: "#111",
              },
            },
            data: data1,
          },
        ],
      };
      myChart.setOption(option);
      setInterval(() => {
        myChart.setOption(option);
      }, 7000);
    },
    async ec4() {
      let myChart = echarts.init(document.getElementById("b4-ad"));
      // let count = await request.get('/base/echart/5');
      // let arr = [[],[]];
      // let arr2 = []
      //  for (let key of count.data) {
      //   arr[0].push(key.a)
      //   arr[1].push(key.b)
      //  }
      //  for (let i = 0; i < 1462; i++) {
      //   let item = [arr[0][i],arr[1][i]]
      //   arr2.push(item)
      //  }
      //  console.log(arr2);
      let option = {
        title: {
          text: "书籍对应价格储量表(1~200元)",
          x: "center",
          y: 0,
          textStyle: {
            color: "#4c4c4c",
            fontSize: 16,
            fontWeight: "normal",
          },
        },
        visualMap: {
          min: 1,
          max: 200,
          dimension: 1,
          left: "right",
          top: "top",
          text: ["最高价", "最低价"], // 文本，默认为数值文本
          calculable: true,
          itemWidth: 18,
          itemHeight: 160,
          textStyle: {
            color: "#4c4c4c",
            height: 56,
            fontSize: 11,
            lineHeight: 60,
          },
          inRange: {
            color: ["#3EACE5", "#9AADE9"],
          },
          padding: [50, 20],
          orient: "horizontal",
        },
        grid: {
          left: "5%",
          right: "20%",
          bottom: "3%",
          containLabel: true,
        },
        tooltip: {
          trigger: "item",
          showDelay: 0,
          formatter: function (params) {
            if (params.value.length > 1) {
              return (
                "该价格书籍储量: " +
                params.value[0] +
                "本 " +
                "书籍价格: " +
                params.value[1] +
                " 元 "
              );
            } else {
              return (
                params.seriesName +
                " :<br/>" +
                params.name +
                " : " +
                params.value +
                " 元 "
              );
            }
          },
          axisPointer: {
            show: true,
            type: "cross",
            lineStyle: {
              type: "dashed",
              width: 1,
            },
          },
        },

        xAxis: [
          {
            name: "储量/本",
            type: "value",
            scale: true,
            axisLabel: {
              formatter: "{value}",
            },
            nameTextStyle: {
              color: "#4c4c4c",
              fontSize: 13,
            },
            axisTick: {
              show: true,
            },
            axisLine: {
              lineStyle: {
                color: "#4c4c4c",
              },
            },
            splitLine: {
              show: false,
            },
          },
        ],
        yAxis: [
          {
            name: "价格/元",
            type: "value",
            scale: true,
            axisLabel: {
              formatter: "{value}",
            },
            nameTextStyle: {
              color: "#4c4c4c",
              fontSize: 14,
            },
            axisTick: {
              show: true,
            },
            axisLine: {
              lineStyle: {
                color: "#4c4c4c",
              },
            },
            splitLine: {
              show: true,
            },
          },
        ],
        series: [
          {
            name: "price-area",
            type: "scatter",
            data: [
              [2979, 200],
              [1151, 199],
              [9601, 198],
              [143, 197],
              [435, 196],
              [466, 195],
              [76, 194],
              [37, 193],
              [260, 192],
              [49, 191],
              [859, 190],
              [516, 189],
              [2854, 188],
              [151, 187],
              [442, 186],
              [341, 185],
              [153, 184],
              [78, 183],
              [132, 182],
              [105, 181],
              [5764, 180],
              [331, 179],
              [1378, 178],
              [94, 177],
              [257, 176],
              [404, 175],
              [187, 174],
              [167, 173],
              [160, 172],
              [100, 171],
              [669, 170],
              [749, 169],
              [8420, 168],
              [203, 167],
              [398, 166],
              [534, 165],
              [171, 164],
              [240, 163],
              [194, 162],
              [120, 161],
              [3522, 160],
              [586, 159],
              [5305, 158],
              [169, 157],
              [947, 156],
              [365, 155],
              [98, 154],
              [331, 153],
              [625, 152],
              [181, 151],
              [4666, 150],
              [1134, 149],
              [4088, 148],
              [185, 147],
              [466, 146],
              [842, 145],
              [489, 144],
              [120, 143],
              [620, 142],
              [128, 141],
              [1838, 140],
              [1737, 139],
              [6143, 138],
              [268, 137],
              [1053, 136],
              [1090, 135],
              [202, 134],
              [195, 133],
              [599, 132],
              [274, 131],
              [1923, 130],
              [1749, 129],
              [16335, 128],
              [348, 127],
              [870, 126],
              [1098, 125],
              [291, 124],
              [310, 123],
              [874, 122],
              [191, 121],
              [7828, 120],
              [1801, 119],
              [7183, 118],
              [159, 117],
              [1046, 116],
              [823, 115],
              [351, 114],
              [315, 113],
              [1020, 112],
              [382, 111],
              [2336, 110],
              [1822, 109],
              [6983, 108],
              [126, 107],
              [753, 106],
              [878, 105],
              [440, 104],
              [120, 103],
              [810, 102],
              [670, 101],
              [6047, 100],
              [9988, 99],
              [31925, 98],
              [290, 97],
              [3705, 96],
              [3964, 95],
              [468, 94],
              [328, 93],
              [1482, 92],
              [207, 91],
              [6308, 90],
              [11414, 89],
              [26140, 88],
              [566, 87],
              [4533, 86],
              [5790, 85],
              [769, 84],
              [624, 83],
              [2068, 82],
              [570, 81],
              [15228, 80],
              [13555, 79],
              [24876, 78],
              [709, 77],
              [3983, 76],
              [8093, 75],
              [597, 74],
              [713, 73],
              [4808, 72],
              [399, 71],
              [11402, 70],
              [20891, 69],
              [52842, 68],
              [956, 67],
              [6614, 66],
              [13715, 65],
              [1810, 64],
              [1900, 63],
              [5201, 62],
              [571, 61],
              [27717, 60],
              [25805, 59],
              [51112, 58],
              [1887, 57],
              [16513, 56],
              [17434, 55],
              [4058, 54],
              [3358, 53],
              [12889, 52],
              [1231, 51],
              [44478, 50],
              [38018, 49],
              [65961, 48],
              [3790, 47],
              [17979, 46],
              [54689, 45],
              [3568, 44],
              [9893, 43],
              [34055, 42],
              [2451, 41],
              [67512, 40],
              [49379, 39],
              [71110, 38],
              [12026, 37],
              [55379, 36],
              [68965, 35],
              [13047, 34],
              [24774, 33],
              [61392, 32],
              [5517, 31],
              [104766, 30],
              [42744, 29],
              [85217, 28],
              [22290, 27],
              [43683, 26],
              [81050, 25],
              [30707, 24],
              [26006, 23],
              [40341, 22],
              [12829, 21],
              [86201, 20],
              [25372, 19],
              [53562, 18],
              [27881, 17],
              [39392, 16],
              [55330, 15],
              [27431, 14],
              [29702, 13],
              [36978, 12],
              [13660, 11],
              [46198, 10],
              [18231, 9],
              [22375, 8],
              [17419, 7],
              [19055, 6],
              [19971, 5],
              [22028, 4],
              [27263, 3],
              [36086, 2],
              [52387, 1],
            ],
            symbolSize: 3,
          },
        ],
      };
      myChart.setOption(option);
    },
    async ec5() {
      // let num = await request.get('/base/echart/6');
      // let num1 = await request.get('/base/echart/7');
      // let name = num.data.map(item=>item.publisher)
      // let amount = num.data.map(item=>item.num)
      // let amount1 = num1.data.map(item=>item.num)

      let name = [
        "科学出版社",
        "机械工业出版社",
        "清华大学出版社",
        "人民邮电出版社",
        "化学工业出版社",
        "电子工业出版社",
        "高等教育出版社",
        "中国社会科学出版社",
        "人民卫生出版社",
        "北京大学出版社",
        "中国人民大学出版社",
        "社会科学文献出版社",
        "中国建筑工业出版社",
        "人民出版社",
        "法律出版社",
        "中国电力出版社",
        "中国铁道出版社",
        "经济科学出版社",
        "北京理工大学出版社",
        "浙江大学出版社",
        "上海人民出版社",
        "人民文学出版社",
        "暂缺",
        "商务印书馆",
        "中国纺织出版社",
        "中国法制出版社",
        "中国农业出版社",
        "外语教学与研究出版社",
        "华中科技大学出版社",
        "北京师范大学出版社",
        "世界图书出版公司",
        "南京大学出版社",
        "北京联合出版公司",
        "上海交通大学出版社",
        "武汉大学出版社",
        "国防工业出版社",
        "中华书局",
        "中国青年出版社",
        "上海科学技术出版社",
        "华东师范大学出版社",
        "江苏人民出版社",
        "上海古籍出版社",
        "人民交通出版社",
        "复旦大学出版社",
        "吉林出版集团有限责任公司",
        "中国财政经济出版社",
        "重庆出版社",
        "中国水利水电出版社",
        "广西师范大学出版社",
        "中国经济出版社",
        "经济管理出版社",
        "中国医药科技出版社",
        "中国华侨出版社",
        "作家出版社",
        "知识产权出版社",
        "人民军医出版社",
        "石油工业出版社",
        "广东人民出版社",
        "中国轻工业出版社",
        "中国中医药出版社",
        "中国劳动社会保障出版社",
        "中国林业出版社",
        "中国政法大学出版社",
        "西南交通大学出版社",
        "青岛出版社",
        "东南大学出版社",
        "金盾出版社",
        "重庆大学出版社",
        "北京教育出版社",
        "长江文艺出版社",
        "北京出版社",
        "吉林美术出版社",
        "辽宁科学技术出版社",
        "华夏出版社",
        "新世界出版社",
        "东方出版社",
        "天津人民出版社",
        "光明日报出版社",
        "湖南文艺出版社",
        "冶金工业出版社",
        "上海文艺出版社",
        "上海译文出版社",
        "北京科学技术出版社",
        "人民教育出版社",
        "译林出版社",
        "大连理工大学出版社",
        "江苏凤凰文艺出版社",
        "上海人民美术出版社",
        "上海科学技术文献出版社",
        "齐鲁书社",
        "现代出版社",
        "人民日报出版社",
        "上海外语教育出版社",
        "山东人民出版社",
        "湖北美术出版社",
        "新华出版社",
        "四川人民出版社",
        "中国标准出版社",
        "北方妇女儿童出版社",
        "外文出版社",
        "湖南人民出版社",
        "中国金融出版社",
        "同济大学出版社",
        "湖南美术出版社",
        "中国商业出版社",
        "西南财经大学出版社",
        "中信出版社",
        "中国石化出版社",
        "花城出版社",
        "上海教育出版社",
        "农业出版社",
        "立信会计出版社",
        "浙江教育出版社",
        "厦门大学出版社",
        "江苏文艺出版社",
        "中国农业科学技术出版社",
        "吉林大学出版社",
        "西安交通大学出版社",
        "水利水电出版社",
        "九州出版社",
        "文物出版社",
        "天津大学出版社",
        "浙江少年儿童出版社",
        "山西人民出版社",
        "云南人民出版社",
        "中央编译出版社",
        "中国文史出版社",
        "四川大学出版社",
        "民族出版社",
        "上海三联书店",
        "科学技术文献出版社",
        "中国人口出版社",
        "海洋出版社",
        "辽宁人民出版社",
        "吉林人民出版社",
        "江西美术出版社",
        "中信出版集团",
        "北京航空航天大学出版社",
        "教育科学出版社",
        "浙江人民出版社",
        "河南科学技术出版社",
        "安徽少年儿童出版社",
        "中山大学出版社",
        "东北财经大学出版社",
        "哈尔滨出版社",
        "江苏科学技术出版社",
        "文化艺术出版社",
        "黄山书社",
        "中央广播电视大学出版社",
        "地质出版社",
        "上海社会科学院出版社",
        "煤炭工业出版社",
        "贵州人民出版社",
        "气象出版社",
        "世界知识出版社",
        "广东科技出版社",
        "万卷出版公司",
        "华南理工大学出版社",
        "暨南大学出版社",
        "科学普及出版社",
        "新星出版社",
        "企业管理出版社",
        "哈尔滨工业大学出版社",
        "中国少年儿童出版社",
        "人民法院出版社",
        "西南师范大学出版社",
        "西安电子科技大学出版社",
        "浙江人民美术出版社",
        "安徽人民出版社",
        "中国科学技术出版社",
        "学苑出版社",
        "中国书籍出版社",
        "中国社会出版社",
        "人民美术出版社",
        "华东理工大学出版社",
        "长江少年儿童出版社",
        "百花文艺出版社",
        "天津科学技术出版社",
        "中国矿业大学出版社",
        "安徽文艺出版社",
        "湖南少年儿童出版社",
        "中国友谊出版公司",
        "江苏凤凰科学技术出版社",
        "人民音乐出版社",
        "浙江文艺出版社",
        "时代文艺出版社",
        "漓江出版社",
        "天津人民美术出版社",
        "吉林科学技术出版社",
        "海天出版社",
        "北京工业大学出版社",
        "江西人民出版社",
        "安徽美术出版社",
        "苏州大学出版社",
        "中国统计出版社",
        "辽宁美术出版社",
        "百花洲文艺出版社",
        "四川文艺出版社",
        "华中师范大学出版社",
        "团结出版社",
        "吉林文史出版社",
        "黑龙江科学技术出版社",
        "湖南教育出版社",
        "接力出版社",
        "长春出版社",
        "安徽科学技术出版社",
        "河南人民出版社",
        "浙江工商大学出版社",
        "南开大学出版社",
        "湖南科学技术出版社",
        "人民体育出版社",
        "中国文联出版社",
        "陕西人民教育出版社",
        "上海音乐出版社",
        "中国言实出版社",
        "陕西师范大学出版社",
        "中国旅游出版社",
        "陕西人民出版社",
        "知识出版社",
        "黄河水利出版社",
        "吉林摄影出版社",
        "商务印书馆出版社",
        "广东高等教育出版社",
        "中华工商联合出版社",
        "中国科学技术大学出版社",
        "春风文艺出版社",
        "湖北教育出版社",
        "湖北人民出版社",
        "上海财经大学出版社",
        "文汇出版社",
        "黑龙江美术出版社",
        "首都师范大学出版社",
        "上海书画出版社",
        "群众出版社",
        "天地出版社",
        "江苏美术出版社",
        "山东科学技术出版社",
        "中国人民公安大学出版社",
        "北京体育大学出版社",
        "地震出版社",
        "浙江科学技术出版社",
        "海豚出版社",
        "郑州大学出版社",
        "南海出版公司",
        "华文出版社",
        "上海辞书出版社",
        "台海出版社",
        "金城出版社",
        "中共中央党校出版社",
        "北京时代华文书局",
        "广东教育出版社",
        "合肥工业大学出版社",
        "新世纪出版社",
        "广西人民出版社",
        "湖北科学技术出版社",
        "生活·读书·新知三联书店",
        "广东经济出版社",
        "中国建材工业出版社",
        "北京语言大学出版社",
        "内蒙古人民出版社",
        "中国地图出版社",
        "广东旅游出版社",
        "凤凰出版社",
        "上海大学出版社",
        "中国工人出版社",
        "二十一世纪出版社",
        "龙门书局",
        "黑龙江人民出版社",
        "辽宁教育出版社",
        "中国大百科全书出版社",
        "宁夏人民出版社",
        "上海文化出版社",
        "上海科学普及出版社",
        "中国戏剧出版社",
        "北岳文艺出版社",
        "旅游教育出版社",
        "少年儿童出版社",
        "四川美术出版社",
        "东北师范大学出版社",
        "福建人民出版社",
        "四川科学技术出版社",
        "中国环境科学出版社",
        "武汉理工大学出版社",
        "航空工业出版社",
        "民主与建设出版社",
        "西北工业大学出版社",
        "河北教育出版社",
        "中国农业大学出版社",
        "对外经济贸易大学出版社",
        "吉林教育出版社",
        "上海书店出版社",
        "中国电影出版社",
        "哈尔滨工程大学出版社",
        "中南大学出版社",
        "花山文艺出版社",
        "电子科技大学出版社",
        "中国广播电视出版社",
        "中国财富出版社",
        "湖南大学出版社",
        "二十世纪出版社",
      ];
      //总量
      let data1 = [
        59751, 56202, 47629, 42064, 39324, 38280, 37001, 26123, 25543, 23684,
        22512, 21577, 21410, 20445, 19541, 18087, 16930, 16512, 16175, 14502,
        14427, 13877, 13757, 13401, 12832, 12724, 12422, 12308, 12062, 11855,
        11441, 11322, 11134, 11037, 10772, 10762, 10751, 10735, 10514, 10488,
        10305, 10242, 10236, 10171, 10133, 10096, 9988, 9853, 9806, 9586, 9508,
        8951, 8670, 8610, 8519, 8346, 8209, 8189, 8135, 8104, 7902, 7776, 7711,
        7664, 7648, 7642, 7606, 7569, 7564, 7479, 7417, 7063, 7018, 7010, 6962,
        6833, 6710, 6643, 6628, 6608, 6526, 6520, 6499, 6418, 6411, 6373, 6373,
        6268, 6202, 6189, 6158, 6124, 6079, 6009, 6000, 5981, 5895, 5895, 5832,
        5796, 5780, 5613, 5475, 5420, 5418, 5416, 5409, 5396, 5378, 5373, 5351,
        5334, 5314, 5298, 5288, 5215, 5206, 5192, 5181, 5094, 5050, 5048, 4995,
        4933, 4910, 4904, 4859, 4844, 4841, 4840, 4837, 4800, 4724, 4717, 4712,
        4678, 4671, 4611, 4605, 4574, 4557, 4544, 4509, 4500, 4479, 4466, 4455,
        4446, 4396, 4390, 4366, 4366, 4345, 4345, 4312, 4263, 4245, 4245, 4236,
        4224, 4208, 4191, 4185, 4176, 4172, 4164, 4160, 4155, 4106, 4088, 4088,
        4088, 4087, 4072, 4016, 3999, 3986, 3977, 3969, 3948, 3932, 3931, 3913,
        3911, 3902, 3898, 3883, 3860, 3859, 3855, 3850, 3844, 3808, 3800, 3754,
        3738, 3729, 3701, 3701, 3693, 3689, 3672, 3653, 3626, 3563, 3549, 3546,
        3544, 3538, 3536, 3518, 3513, 3490, 3484, 3478, 3452, 3433, 3431, 3427,
        3394, 3394, 3375, 3367, 3331, 3326, 3324, 3318, 3311, 3307, 3285, 3283,
        3283, 3280, 3261, 3250, 3246, 3245, 3196, 3179, 3123, 3118, 3117, 3096,
        3081, 3080, 3079, 3073, 3072, 3066, 3053, 3050, 3042, 3016, 3014, 2998,
        2984, 2976, 2976, 2966, 2938, 2937, 2933, 2924, 2917, 2903, 2901, 2898,
        2881, 2874, 2865, 2854, 2839, 2823, 2820, 2809, 2798, 2798, 2789, 2782,
        2781, 2757, 2750, 2741, 2733, 2732, 2723, 2719, 2716, 2715, 2710, 2705,
        2705, 2673, 2667, 2655, 2653, 2650, 2647, 2645, 2641,
      ];
      //有折扣的
      let data2 = [
        49197, 48044, 44321, 37679, 36513, 34312, 32496, 23525, 21356, 20452,
        20322, 20199, 18360, 17540, 17068, 16974, 15304, 14869, 14799, 13564,
        12149, 12030, 11602, 11313, 11090, 10646, 10584, 10579, 10313, 10274,
        9871, 9853, 9747, 9503, 9388, 9211, 9151, 9085, 9020, 8813, 8582, 8238,
        8187, 8032, 8031, 7862, 7723, 7616, 7545, 7470, 7427, 7302, 7276, 7223,
        7163, 7128, 7110, 7028, 6936, 6904, 6844, 6788, 6769, 6713, 6669, 6658,
        6634, 6518, 6164, 6136, 6057, 6015, 6004, 5870, 5808, 5717, 5690, 5653,
        5601, 5586, 5553, 5404, 5390, 5370, 5355, 5292, 5183, 5170, 5168, 5118,
        5084, 4978, 4889, 4882, 4865, 4846, 4797, 4796, 4791, 4730, 4719, 4682,
        4674, 4631, 4617, 4579, 4562, 4544, 4540, 4402, 4383, 4342, 4323, 4320,
        4313, 4238, 4221, 4219, 4205, 4141, 4139, 4087, 4085, 4080, 4038, 4018,
        4007, 3987, 3966, 3945, 3924, 3919, 3870, 3846, 3798, 3758, 3734, 3725,
        3661, 3657, 3650, 3644, 3622, 3595, 3581, 3579, 3573, 3538, 3515, 3508,
        3491, 3490, 3458, 3457, 3457, 3442, 3440, 3405, 3401, 3389, 3366, 3348,
        3347, 3339, 3329, 3322, 3318, 3313, 3309, 3296, 3264, 3255, 3227, 3221,
        3217, 3169, 3161, 3160, 3148, 3130, 3128, 3108, 3070, 3056, 3049, 3048,
        3046, 3041, 3033, 3020, 3014, 3009, 3008, 2994, 2991, 2982, 2980, 2974,
        2966, 2962, 2933, 2923, 2920, 2905, 2900, 2892, 2889, 2883, 2877, 2869,
        2860, 2856, 2851, 2839, 2826, 2820, 2811, 2798, 2778, 2763, 2750, 2744,
        2736, 2732, 2727, 2722, 2720, 2711, 2705, 2699, 2673, 2661, 2654, 2646,
        2620, 2615, 2610, 2600, 2586, 2560, 2559, 2554, 2542, 2530, 2530, 2521,
        2507, 2490, 2481, 2476, 2474, 2447, 2443, 2442, 2438, 2424, 2404, 2401,
        2400, 2388, 2377, 2373, 2372, 2359, 2345, 2344, 2312, 2307, 2306, 2299,
        2299, 2298, 2289, 2284, 2280, 2279, 2278, 2266, 2265, 2252, 2245, 2243,
        2243, 2240, 2231, 2229, 2207, 2171, 2160, 2159, 2159, 2156, 2139, 2138,
        2137, 2135, 2129, 2122, 2110, 2108,
      ];
      //没折扣的
      let data3 = [
        10554, 8158, 3308, 4385, 2811, 3968, 4505, 2598, 4187, 3232, 2190, 1378,
        3050, 2905, 2473, 1113, 1626, 1643, 1376, 938, 2278, 1847, 2155, 2088,
        1742, 2078, 1838, 1729, 1749, 1581, 1570, 1469, 1387, 1534, 1384, 1551,
        1600, 1650, 1494, 1675, 1723, 2004, 2049, 2139, 2102, 2234, 2265, 2237,
        2261, 2116, 2081, 1649, 1394, 1387, 1356, 1218, 1099, 1161, 1199, 1200,
        1058, 988, 942, 951, 979, 984, 972, 1051, 1400, 1343, 1360, 1048, 1014,
        1140, 1154, 1116, 1020, 990, 1027, 1022, 973, 1116, 1109, 1048, 1056,
        1081, 1190, 1098, 1034, 1071, 1074, 1146, 1190, 1127, 1135, 1135, 1098,
        1099, 1041, 1066, 1061, 931, 801, 789, 801, 837, 847, 852, 838, 971,
        968, 992, 991, 978, 975, 977, 985, 973, 976, 953, 911, 961, 910, 853,
        872, 886, 852, 857, 875, 895, 913, 881, 854, 871, 914, 920, 937, 886,
        944, 917, 907, 900, 887, 905, 898, 887, 882, 908, 881, 882, 875, 876,
        887, 888, 855, 821, 805, 840, 835, 835, 842, 843, 838, 837, 843, 842,
        842, 842, 797, 792, 824, 833, 860, 851, 799, 830, 825, 817, 821, 818,
        804, 823, 843, 855, 853, 850, 837, 819, 826, 835, 836, 835, 800, 806,
        763, 756, 749, 727, 735, 731, 756, 749, 733, 721, 663, 657, 657, 661,
        661, 667, 658, 657, 639, 645, 652, 632, 622, 633, 649, 631, 644, 631,
        631, 599, 599, 602, 598, 600, 602, 586, 610, 622, 626, 615, 630, 631,
        635, 596, 593, 563, 559, 563, 554, 551, 550, 558, 566, 582, 585, 577,
        576, 595, 573, 572, 560, 560, 572, 575, 566, 550, 560, 560, 552, 558,
        558, 557, 586, 574, 568, 566, 555, 541, 534, 536, 529, 519, 520, 523,
        517, 529, 512, 507, 498, 493, 501, 494, 512, 545, 555, 551, 546, 549,
        534, 529, 518, 518, 521, 525, 535, 533,
      ];
      //zoomData拖动条
      let start = 0;
      let end = 2;

      let myChart = echarts.init(document.getElementById("b5-ad"));
      let option = {
        title: {
          text: "按出版社分类折扣书籍数量",
          x: "4%",
          textStyle: {
            color: "#4c4c4c",
            fontSize: "15",
          },
        },
        tooltip: {
          trigger: "axis",
          axisPointer: {
            type: "shadow",
            textStyle: {
              color: "#fff",
            },
          },
        },
        grid: {
          borderWidth: 0,
          top: 80,
          bottom: 55,
          textStyle: {
            color: "#fff",
          },
        },
        legend: {
          x: "4%",
          top: "8%",
          textStyle: {
            color: "#90979c",
          },
          data: ["折扣书籍", "未折扣书籍"],
        },

        calculable: true,
        xAxis: [
          {
            type: "category",
            axisLine: {
              lineStyle: {
                color: "#4c4c4c",
              },
            },
            splitLine: {
              show: false,
            },
            axisTick: {
              show: false,
            },
            splitArea: {
              show: false,
            },
            axisLabel: {
              interval: 0,
            },
            data: name,
          },
        ],
        yAxis: [
          {
            type: "value",
            splitLine: {
              show: false,
            },
            axisLine: {
              lineStyle: {
                color: "#4c4c4c",
              },
            },
            axisTick: {
              show: false,
            },
            axisLabel: {
              interval: 0,
            },
            splitArea: {
              show: false,
            },
          },
        ],
        dataZoom: [
          {
            show: true,
            height: 20,
            xAxisIndex: [0],
            bottom: 10,
            start: start,
            end: end,
            handleIcon:
              "path://M306.1,413c0,2.2-1.8,4-4,4h-59.8c-2.2,0-4-1.8-4-4V200.8c0-2.2,1.8-4,4-4h59.8c2.2,0,4,1.8,4,4V413z",
            handleSize: "110%",
            handleStyle: {
              color: "#d3dee5",
            },
            textStyle: {
              color: "#fff",
            },
            borderColor: "#90979c",
          },
          // {
          //   type: "inside",
          //   show: true,
          //   height: 15,
          //   start: 0,
          //   end: 3,
          // },
        ],
        series: [
          {
            name: "折扣书籍",
            type: "bar",
            stack: "总量",
            barMaxWidth: 35,
            barGap: "10%",
            itemStyle: {
              normal: {
                color: "rgba(255,144,128,1)",
                label: {
                  show: true,
                  textStyle: {
                    color: "#fff",
                  },
                  position: "inside",
                  formatter: function (p) {
                    return p.value > 0 ? p.value : "";
                  },
                },
              },
            },
            data: data2,
          },

          {
            name: "未折扣书籍",
            type: "bar",
            stack: "总量",
            itemStyle: {
              normal: {
                color: "rgba(0,191,183,1)",
                barBorderRadius: 0,
                label: {
                  show: true,
                  position: "inside",
                  formatter: function (p) {
                    return p.value > 0 ? p.value : "";
                  },
                },
              },
            },
            data: data3,
          },
          {
            name: "总数",
            type: "line",
            symbolSize: 10,
            symbol: "circle",
            itemStyle: {
              normal: {
                color: "rgba(252,230,48,1)",
                barBorderRadius: 0,
                label: {
                  show: true,
                  position: "top",
                  formatter: function (p) {
                    return p.value > 0 ? p.value : "";
                  },
                },
              },
            },
            data: data1,
          },
        ],
      };
      myChart.setOption(option);

      setInterval(() => {
        if (end < 100) {
          start = start + 1.2;
          end = end + 1.2;
        } else {
          start = 0;
          end = 2;
        }
        myChart.setOption({
          dataZoom: [
            {
              start: start,
              end: end,
            },
          ],
        });
      }, 6000);
    },
    async newBook() {
      let result = await request.get(`/du/book/`);
      if (result.status == 200) {
        this.list = []; //每次重启记得清空数组
        let html = result.data;
        let $ = cheerio.load(html, { decodeEntities: false });
        let length = $(".container .row .bookslist ul li").length;
        this.length = length;
        for (let i = 0; i < length; i++) {
          let img = $(
            `.container .row .bookslist li:nth-of-type(${i + 1}) .img152 a img`
          ).attr("data-original");
          let name = $(
            `.container .row .bookslist li:nth-of-type(${i + 1}) .img152 a img`
          ).attr("alt");
          let author = $(
            `.container .row .bookslist li:nth-of-type(${
              i + 1
            }) p:nth-of-type(1)`
          ).text();
          let bookUrl = $(
            `.container .row .bookslist li:nth-of-type(${i + 1}) .img152 a`
          ).attr("href");
          let imgFix;
          if (typeof img == "undefined") {
            imgFix = "../../imgs/error.jpg";
          } else {
            imgFix = img.replace("https://img.dushu.com", "/dt");
          }

          let list = { imgFix, name, author, bookUrl }; //单个数据
          this.list.push(list); //数据插入
        }
      }
    },
    async goBook(item) {
      let mainstore = useStore();
      mainstore.bookUrl = item.bookUrl;
    },

    initScroll() {
      this.$nextTick(() => {
        this.copyHtml = this.$refs.scrollItemBox.innerHTML;
        this.startScroll();
      });
    },
    // 鼠标移入停止滚动
    mEnter() {
      clearInterval(timer);
    },
    // 鼠标移出继续滚动
    mLeave() {
      this.startScroll();
    },
    // 开始滚动
    startScroll() {
      timer = setInterval(this.scroll, this.speed);
    },
    // 滚动处理方法
    scroll() {
      this.scrollTop++;
      // 获取需要滚动的盒子的高度
      // 当判断滚动的高度大于等于盒子高度时，从头开始滚动
      if (this.scrollTop >= 920) {
        this.scrollTop = 0;
      }
    },
  },

  mounted() {
    this.ec1(); //玫瑰图以及数量
    this.ec2(); //柱状行列
    this.ec3(); //词云
    this.ec4(); //价格区间
    this.ec5(); //按出版社分折扣
    this.newBook(); //新书

    this.initScroll();
  },
};
</script>
<style>
/* 词云们的父亲 */
.bbox-ad {
  display: inline-block;
  width: 100%;
  height: 100%;
  background: #d3d3d1 url("../../public/imgs/nbg/shenhui.png") repeat;
}
/* 词云每个盒子的参数，没有宽高 */
.b-ad {
  border-radius: 4px;
  border: solid 1px #ddd;
  box-shadow: 0 2px 4px rgb(0 0 0 / 12%), 0 0 6px rgb(0 0 0 / 4%);
  background: #606266(0, 0, 0, 0.9);
  backdrop-filter: blur(10px);
  background: #d3d3d1 url("../../public/imgs/nbg/hui.png") repeat;
  display: inline-block;
  margin-top: 1vh;
  padding-top: 20px;
  padding-bottom: 20px;
}
.title-ad {
  text-align: center;
  padding: 3px;
  font-size: 25px;
  color: #4c4c4c;
  font-weight: bold;
  display: block;
}
.box1-ad {
  width: 25vw;
  height: 52vh;
  margin-left: 1%;
  display: inline-block;
}
.box2-ad {
  width: 50vw;
  height: 52vh;
  margin-left: 1%;
  display: inline-block;
}
.box3-ad {
  width: 20vw;
  height: 52vh;
  margin-left: 1%;
  display: inline-block;
}
.box4-ad {
  width: 99%;
  height: 35vh;
  margin-left: 1%;
}
#b1-ad {
  width: 100%;
  height: 25vh;
}
#b2-ad {
  width: 100%;
  height: 23vh;
  margin-top: 3%;
}
#b3-ad {
  width: 100%;
}
#b4-ad {
  width: 100%;
  height: 23vh;
  margin-top: 3%;
}
#b5-ad {
  width: 70%;
  height: 27vh;
  margin-right: 1vw;
}
#b6-ad {
  width: 27%;
  height: 27vh;
  margin-right: 1vw;
}
@media (max-width: 736px) {
  .scroll_parent_box {
    width: 98vw;
    margin-left: 1vw;
  }
  .box1-ad {
    width: 98vw;
    margin-left: 1vw;
  }
  .box2-ad {
    width: 98vw;
    margin-left: 1vw;
  }
  .box3-ad {
    width: 98vw;
    margin-left: 1vw;
  }
  .box4-ad {
    width: 98vw;
    margin-left: 1vw;
    margin-right: 1vw;
  }
#b1-ad {
  height: 35vh;
}
#b2-ad {
  height: 35vh;
}
#b4-ad {
  height: 35vh;
}
#b5-ad {
  height: 45vh;
  width: 100%;
}
#b6-ad {
  width: 100%;
  height: 35vh;
}

}
/* 每个单元 */
.list-li-ad {
  overflow: hidden;
  padding-left: 14px;
  width: 152px;
  height: 270px;
  display: inline-block;
  text-align: center;
}

.r-img-ad {
  display: block;
  padding-top: 9px;
  padding-bottom: 13px;
  margin-bottom: 16px;
  height: 142px;
  width: 142px;
  transition-duration: 0.3s;
}

.r-img-ad:hover {
  transform: scale(1.1);
  box-shadow: 0 10px 10px -10px rgba(85, 122, 245, 0.5);
}

.r-name-ad {
  color: #4c4c4c;
  font-size: 16px;
  font-weight: bold;
  transition-duration: 0.3s;
  max-height: 42px;
  display: inline-block;
  width: 152px;
  text-overflow: ellipsis;
}
.r-name-overflow-ad {
  width: 152px;
  max-height: 42px;
  overflow: hidden;
  text-overflow: ellipsis;
  display: -webkit-box;
  -webkit-line-clamp: 2;
  -webkit-box-orient: vertical;
}
.r-author-ad {
  text-align: center;
  font-size: 13px;
  color: #888;
  padding-top: 10px;
}
.r-name-ad:hover {
  color: #409eff;
}
.ul-ad {
  margin-left: auto;
  margin-right: auto;
}

/* 以下是平移盒子 */
.InfiniteScroll {
  box-sizing: border-box;
  padding: 1px;
  width: 50vw;
}

.scroll_parent_box {
  overflow: hidden;
  box-sizing: border-box;
  padding: 0 10px;
  height: 52vh;
}

.scroll_list {
  transition: all 0ms ease-in 0s;
}

.bid3-ad {
  border-radius: 4px;
  border: solid 1px #ddd;
  box-shadow: 0 2px 4px rgb(0 0 0 / 12%), 0 0 6px rgb(0 0 0 / 4%);
  background: #606266(0, 0, 0, 0.9);
  backdrop-filter: blur(10px);
  background: #d3d3d1 url("../../public/imgs/nbg/shenhui.png") repeat;
  padding: 2%;
  margin: 1%;
  margin-left: 3%;
  font-size: 20px;
  height: 13%;
  transition-duration: 0.5s;
  color: #4c4c4c;
}

.bid3-ad > span {
  font-family: "youyuan";
  font-size: 23px;
  color: #888;
}

.bid3-ad:hover {
  color: #409eff;
  transform: translateX(3%);
}
</style>